Now, we use the .drop_duplicates method to keep only the first row of every year.

By default, .drop_duplicates keeps the very first appearance of a value, but this behavior may be modified by passing keep='last' to select the last row of each group or keep=False to drop all duplicates entirely.

In [1]:
import pandas as pd

In [2]:
tbl = {'col1':[1,2,2,2,2,3,3,3,3,3,3,3,3,3], 
       'col2':[1,2,3,4,5,6,7,8,9,0,1,2,3,4]}
df = pd.DataFrame(tbl)

In [3]:
df

    col1  col2
0      1     1
1      2     2
2      2     3
3      2     4
4      2     5
5      3     6
6      3     7
7      3     8
8      3     9
9      3     0
10     3     1
11     3     2
12     3     3
13     3     4

In [4]:
df.drop_duplicates(subset = 'col1')

   col1  col2
0     1     1
1     2     2
5     3     6

In [10]:
(df
 .sort_values(['col1', 'col2'], ascending=[False, False])
 .drop_duplicates(subset = 'col1')
)

   col1  col2
8     3     9
4     2     5
0     1     1

In [8]:
(df
 .sort_values(['col1', 'col2'], ascending=[False, False])
 .drop_duplicates(subset = 'col1', keep = 'last')
)

   col1  col2
9     3     0
1     2     2
0     1     1